#include "guha.hpp"
#include <cmath>
#include <random>

std::vector<float> norm(std::vector<float> v){
	float sum=0.0; //сумма = 0
	for(auto i:v) sum+=i; //сумма всех членов вектора
	for(auto &i:v) i/=sum; //деление вектора на сумму его членов
	return v;
}/**<Функция нормализации вектора
@param v - нормализуемый вектор
@returns Вектор, сумма членов которого равна 1*/ //функция нормализации

float all=0.2, character=3, depends=1.5; //внешние параметры

float FIMPLE(float a, float b){
	if(a<all) return 0.0;
	return a/(a+b);
}/**<Импликационная функция FIMPLE
@param a - числитель
@param b - добавка к знаменателю
@returns Результат деления a на сумму a и b, если a больше @ref all "порога", иначе 0.*/ //функция FIMPLE

std::vector<std::string> rules={}, names={}; //векторы содержащие правила и наименования атрибутов
std::vector<int> nodes={
	1*1+1*2+1*4,
	0*1+1*2+1*4,
	0*1+1*2+0*4,
	1*1+0*2+1*4,
	1*1+0*2+1*4,
	1*1+1*2+1*4,
	1*1+0*2+0*4,
	1*1+0*2+1*4,
	0*1+1*2+0*4,
	1*1+1*2+1*4
}, msk={1, 2, 4}; //векторы содержащие объекты и маски атрибутов
//содержимое nodes в итоге является числами, нужно для сокращения использования оперативной памяти

/** @brief Собиратель совпадений

Считает количество пересечений, свободных атрибутов, и отсутствия обоих, составляя тем самым правило.*/
struct noded{

	//АТРИБУТЫ//
	
	int a,/**<Первая маска*/ b;/**<Вторая маска*/ //маски
	std::vector<float> rule={0.0,0.0,0.0,0.0};/**<Правило по которому они связаны*/ //вектор с правилом
	std::string formatted="";/**<Письменное представление правила*/ //строка с правилом
	
	//МЕТОДЫ//
	
	/**Конструктор структуры
	@param "a, b" - Первая и вторая маски*/
	noded(int a, int b):a(a), b(b){}
	//конструктор, в нем в первую ячейку помещается меньшая маска
	
	/**@returns Нормализованный вектор правило*/
	explicit operator std::vector<float>() const{ return norm(rule); } 
	//возвращает нормализованный вектор правила
	
	/**Метод, возвращающий составную маску
	@returns Наложение масок a и b (a|b)*/
	explicit operator int() const{ return a|b; }
	//возвращает производную маску (например AB->DE => ABDE)
	
	/**Метод, возвращающий истину если правило сильное
	@returns Результат проверки на отсутствие спец. отношения в @ref character "периоде".*/
	explicit operator bool() const{ 
		float t=(FIMPLE(rule[3], rule[2])*FIMPLE(rule[3], rule[1]))/
		(FIMPLE(rule[2], rule[0])*FIMPLE(rule[1], rule[0])); 
		//отношение разности и объединения
		return t>character||t<1.0/character; //если отношение неяркое то оно слабое
	}//возвращает истину если связь достаточно сильная
	
	/**Метод, возвращающий правило в письменной форме, если количество пересечений больше @ref all "минимума".
	@returns Письменное представление правила, которое получилось после обработки*/
	explicit operator std::string() const{
		return formatted; //иначе возвращаем сформированную строку
	}//возвращает строку если связь сильная и появлений достаточно
	
	/**Метод, добавляющий к правилу объект.
	@param o - Объект (его атрибуты рассматриваются в бинарной форме)*/
	void operator+(int o){
		bool phi=((a&o)==a), psi=((b&o)==b); //наложение масок на объект, выявление принадлежности
		rule[phi|(psi<<1)]++; //построение правила (в бинарной системе: psi - десятки, phi - единицы)
	}//дополняет ассоциативное правило
	
	/**Метод, который анализирует правило и формирует письменный вывод. Задействует векторы @ref msk "масок" и @ref names "имен", чтобы сформировать имена для составной маски. По @ref all "коэффициенту количества", @ref character "коэффициенту характера" и @ref depends "коэффициенту зависимости" создает представление правила в письменной форме.*/
	void operator()(){
		if(!((rule[3]+rule[1]) && (rule[3]+rule[2]))) return;
		//нет смысла искать зависимость между атрибутами которых нет
		std::vector<float> nn=norm(rule); //нормализация
		if(nn[3]<all) return; //если слишком мало связей отбрасываем
		std::string o1="", o2=""; //это возвращаемые имена
		
		for(unsigned int l=0; l<names.size(); l++)
			o1+=(a&msk[l]&&1)? names[l]:""; //поиск имен составляющих маску a
		for(unsigned int l=0; l<names.size(); l++)
			o2+=(b&msk[l]&&1)? names[l]:""; //поиск имен составляющих маску b
		
		float AB=FIMPLE(nn[3],nn[2]), AC=FIMPLE(nn[3],nn[1]), //фимплы
		DB=FIMPLE(nn[2],nn[0]), DC=FIMPLE(nn[1],nn[0]),
		AD=(AB*AC)/(DB*DC),//отношение между разницей и объединением
		T=(AD>=1)? AB/AC:DC/DB; //разница между разницами (тут выявляется направление зависимости)
		if(AD>character){//отношение в пользу прямой связи что А и Б вместе
			if(T>depends) formatted+=o2+"->"+o1+"\n"; //количество А больше чем Б
			else if(T<1.0/depends) formatted+=o1+"->"+o2+"\n"; //количество Б больше чем А
			else formatted+="{edge [dir=none] "+o1+"->"+o2+"}\n"; //количество примерно равно
		}else if(AD<1.0/character){//отношение в пользу обратной связи что А и Б порозень
			if(T>depends) formatted+="{edge [style=dashed] "+o1+"->"+o2+"}\n"; //А больше Б
			else if(T<1.0/depends) formatted+="{edge [style=dashed] "+o2+"->"+o1+"}\n"; //Б больше А
			else formatted+="{edge [style=dashed, dir=none] "+o1+"->"+o2+"}\n"; //А равно Б
		}else{//отношение показывает что связь слабая и скорее А и Б случайно разбросаны
			formatted=""; //тут все обнуляется
			rule=std::vector<float>{0.0,0.0,0.0,0.0};
		}
	}//создает удобное для восприятия представление
}; //структура формирующая правило

std::vector<noded> assoc;/**<Набор объектов правил*/ //вектор структур

std::random_device rd;/**<Генератор случайных чисел (библиотечный)*/ //библиотечный объект

int random_num(int a, int b){
	std::uniform_int_distribution<int> dist(a,b);
	std::mt19937 mt(rd());
	return dist(mt);
}/**<Функция случайных чисел
@param a - Минимум
@param b - Максимум
@returns Случайное число от минимума до максимума*/ //генерирует случайное число от a до b

void mask_gen(std::vector<std::string> n){
	msk.clear(); //очищение вектора
	for(unsigned int i=0; i<n.size(); i++) msk.push_back(std::pow(2,i)); //формирование масок
	//нужно 100... 010... 001... чтобы с их помощью алгоритм мог искать наложения
	names=n; //присваивание имен маскам
} //Функция формирования масок для атрибутов

void rnd(std::vector<std::string> a, int o){
	mask_gen(a); //формирование масок
	nodes.clear(); //очищение вектора объектов
	assoc.clear(); //очищение вектора правил
	for(unsigned int i=0; i<o; i++) nodes.push_back(random_num(1,std::pow(2,a.size())-1));
	//заполнение вектора объектов случайными объектами
} //Функция генератор случайных объектов

bool run_assoc(int a, int b){
	if(a&b) return 0; //маски не должны накладываться
	if(a>b){ 
		int t=a; a=b; b=t; 
	} //если маска а больше б то они меняются местами
	bool flag1=0, flag2=0, lol1=0, lol2=0; //флаги для случаев когда связи слабые
	for(unsigned int i=0; i<assoc.size(); i++)
		if((int)assoc[i].a==a && (int)assoc[i].b==b) return 0; //если связь уже есть то пропускаем
	else if(((int)assoc[i])==a){//если а является составной маской
		flag1|=(bool)assoc[i]; //то правило должно быть сильным
		lol1=1; //указывает что такое правило есть
	}//иначе а слабая и мы ее считать не будем
	else if(((int)assoc[i])==b){
		flag2|=(bool)assoc[i];
		lol2=1;
	}//тоже самое но для б
	if(lol1 && !flag1 || lol2 && !flag2) { 
		return 0; //пропускаем
	} //проверка на силу связей масок основ (из которых состоит эта)
	noded tt(a,b); //правило для 2х масок
	for(auto i:nodes) tt+i; //объекты формируют правило
	assoc.push_back(tt); //вносим правило
	return (bool)tt; //если правило сильное то формируются новые маски
}/**<Функция, которая формирует правило исходя из представленных 2х масок. Функция проходится по вектору @ref assoc "существующих правил", чтобы найти слабые составные правила или повтор, и если условия не нарушены вносит в него @ref noded "новое правило".
@param a - Маска А
@param b - Маска Б
@returns Истина если связь есть и она сильная, ложь если повтор, наложение масок, слабые составные элементы связи, или связь слабая*/ //поиск правила для 2х масок

void guha(unsigned int a){
	std::vector<int> collect=msk, //текущие маски
	temp, //будущие маски
	mask=msk; //прошлые маски
	unsigned int allowed=((a>msk.size()-1)||!a)? msk.size()-1:a; 
	//допуск до полной маски (все атрибуты) либо до ограничения
	for(unsigned int i=0; i<allowed; i++){ //цикл в котором происходят доформирования
		for(auto j:collect){ //цикл идущий только по новым маскам
			for(auto k:mask){ //цикл идущий только по старым маскам
				if(run_assoc(j, k) && //если выполнен то правило есть и сильное
					(j|k!=std::pow(2, msk.size()))) 
					//проверка что маска содержит не все атрибуты
						temp.push_back(j|k); //составная маска (вектор будущих)
			}
		}
		collect=temp;//перенос будущих масок в текущие
		mask.insert(mask.end(), temp.begin(), temp.end());//запись будущих масок в прошлые
		temp.clear();//очищение будущих масок
		//допустим сначала: A B C и D => в collect A,B,C,D; mask A,B,C,D; temp AB,AC,AD,BC,BD,DC;;
		//вторая итерация: A B C D AB AC AD BC BD CD => 
		//в collect AB,AC,AD,BC,BD,DC; mask A,B,C,D,AB,AC,AD,BC,BD,CD; 
		//temp ABC,ABD,ABCD,ACB,ACD,ACDB,ADB,ADC,ADBC,BCA,BCD,BCAD,BDA,BDC,BDAC,DCA,DCB,DCAB;
		//итд...
	}//цикл поиска правил
	for(auto i:assoc) { 
		i(); //формирование письменных правил
		rules.push_back((std::string)i); //хранение
	}assoc.clear();
	//цикл описания правил
}//функция формирует правила по данным, которые хранятся в векторе nodes

